{"Grass": {"description": "The Grass type (Japanese: くさタイプ Grass type) is one of the eighteen types. Notable Trainers who specialize in Grass-type Pokémon are Erika of Celadon City, Gardenia of Eterna City, Cilan of Striaton City, Ramos of Coumarine City, and Trial Captain Mallow of Lush Jungle. Prior to changes in Generation IV, all damaging Grass-type moves were special, but they may now also be physical depending on the attack.\n"}, "Poison": {"description": "The Poison type (Japanese: どくタイプ Poison type) is one of the eighteen types. Notable Trainers who specialize in Poison-type Pokémon include Janine of Fuchsia City, her father Koga of the Indigo Plateau Elite Four, Roxie of Virbank City, and Team Skull Admin Plumeria. Some villainous teams, such as Team Rocket, also frequently use Poison-type Pokémon. Prior to changes in Generation IV, all damaging Poison-type moves were physical, but they may now also be special depending on the attack.\n"}, "Fire": {"description": "The Fire type (Japanese: ほのおタイプ Flame type) is one of the eighteen types. Notable Trainers who specialize in Fire-type Pokémon include Blaine of Cinnabar Island, Flannery of Lavaridge Town, Flint of the Sinnoh Elite Four, Chili of Striaton City, Malva of the Kalos Elite Four, and Trial Captain Kiawe of Paniola Town. Prior to changes in Generation IV, all damaging Fire-type moves were special, but they may now also be physical depending on the attack.\n"}, "Flying": {"description": "The Flying type (Japanese: ひこうタイプ Flying type) is one of the eighteen types. Notable Trainers who specialize in Flying-type Pokémon are the Gym Leaders Falkner of Violet City, Winona of Fortree City, Skyla of Mistralton City, and Kahili of Alola Elite Four. Prior to changes in Generation IV, all damaging Flying-type moves were physical, but they may now also be special depending on the attack.\n"}, "Water": {"description": "The Water type (Japanese: みずタイプ Water type) is one of the eighteen types. Notable Trainers who specialize in Water-type Pokémon include Misty of Cerulean City, Juan and Wallace of Sootopolis City, Crasher Wake of Pastoria City, Cress of Striaton City, Marlon of Humilau City, Siebold of the Kalos Elite Four, and Trial Captain Lana of Konikoni City. Prior to changes in Generation IV, all damaging Water-type moves were special, but they may now also be physical depending on the attack.\n"}, "Bug": {"description": "The Bug type (Japanese: むしタイプ Bug type) is one of the eighteen types. Notable Trainers who specialize in Bug-type Pokémon are Bugsy of Azalea Town, Aaron of the Sinnoh Elite Four, Burgh of Castelia City, Viola of Santalune City, and Team Skull Boss Guzma. Prior to changes in Generation IV, all damaging Bug-type moves were physical, but they may now also be special depending on the attack.\n"}, "Normal": {"description": "The Normal type (Japanese: ノーマルタイプ Normal type) is one of the eighteen types. Notable Trainers who specialize in Normal-type Pokémon are Whitney of Goldenrod City, Norman of Petalburg City, Lenora of Nacrene City, Cheren of Aspertia City, and Trial Captain Ilima of Hau'oli City. Prior to changes in Generation IV, all damaging Normal-type moves were physical, but they may now also be special depending on the attack.\n"}, "Electric": {"description": "The Electric type (Japanese: でんきタイプ Electric type) is one of the eighteen types. Notable Trainers who specialize in Electric-type Pokémon are the Gym Leaders Lt. Surge of Vermilion City, Wattson of Mauville City, Volkner of Sunyshore City, Elesa of Nimbasa City, Clemont of Lumiose City, and Trial Captain Sophocles of the Hokulani Observatory. Prior to changes in Generation IV, all damaging Electric-type moves were special, but they may now also be physical depending on the attack.\n"}, "Ground": {"description": "The Ground type (Japanese: じめんタイプ Ground type) is one of the eighteen types. Notable Trainers who specialize in Ground-type Pokémon are Giovanni of Viridian City, Bertha of the Sinnoh Elite Four, Clay of Driftveil City, and Island Kahuna Hapu of Poni Island. Prior to changes in Generation IV, all damaging Ground-type moves were physical, but they may now also be special depending on the attack.\n"}, "Fairy": {"description": "The Fairy type (Japanese: フェアリータイプ Fairy type) is one of the eighteen types. Notable Trainers who specialize in Fairy-type Pokémon include Gym Leader Valerie of Laverre City, Trial Captain Mina of Poni Island, and Lillie.\n"}, "Fighting": {"description": "The Fighting type (Japanese: かくとうタイプ Fighting type) is one of the eighteen types. Notable Trainers who specialize in Fighting-type Pokémon are Bruno of the Indigo Plateau Elite Four, Chuck of Cianwood City, Brawly of Dewford Town, Maylene of Veilstone City, Marshal of the Unova Elite Four, Korrina of Shalour City and Hala of the Alola Elite FourSM. The Fighting Dojo of Saffron City is also home to several Trainers of Fighting-type Pokémon, although it is no longer an official Gym. Prior to changes in Generation IV, all damaging Fighting-type moves were physical, but they may now also be special depending on the attack.\n"}, "Psychic": {"description": "The Psychic type (Japanese: エスパータイプ Esper type) is one of the eighteen types. Notable Trainers who specialize in Psychic-type Pokémon are Sabrina of Saffron City, Will of the Indigo Plateau Elite Four, Tate and Liza of Mossdeep City, Lucian of the Sinnoh Elite Four, Caitlin of the Battle Castle and the Unova Elite Four, Olympia of Anistar City, Dexio, and Faba of the Aether Foundation. Prior to changes in Generation IV, all damaging Psychic-type moves were special, but they may now also be physical depending on the attack.\n"}, "Rock": {"description": "The Rock type (Japanese: いわタイプ Rock type) is one of the eighteen types. Notable Trainers who specialize in Rock-type Pokémon are Brock of Pewter City, Roxanne of Rustboro City, Roark of Oreburgh City, Grant of Cyllage City, and Olivia of the Alola Elite Four. Jasmine is also stated to have trained Rock types in the past. Prior to changes in Generation IV, all damaging Rock-type moves were physical, but they may now also be special depending on the attack.\n"}, "Steel": {"description": "The Steel type (Japanese: はがねタイプ Steel type) is one of the eighteen types. Notable Trainers who specialize in Steel-type Pokémon are Jasmine of Olivine City, Steven Stone, Champion of Hoenn, Byron of Canalave City, Wikstrom of the Kalos Elite Four, and Molayne of the Alola Elite FourUSUM. Prior to changes in Generation IV, all damaging Steel-type moves were physical, but they may now also be special depending on the attack.\n"}, "Ice": {"description": "The Ice type (Japanese: こおりタイプ Ice type) is one of the eighteen types. Notable Trainers who specialize in Ice-type Pokémon are Lorelei, a former member of the Indigo Plateau Elite Four, Pryce of Mahogany Town, Glacia of the Hoenn Elite Four, Candice of Snowpoint City, Brycen, the former Gym Leader of Icirrus City, Wulfric of Snowbelle City, and Sina. Prior to changes in Generation IV, all damaging Ice-type moves were special, but they may now also be physical depending on the attack.\n"}, "Ghost": {"description": "The Ghost type (Japanese: ゴーストタイプ Ghost type) is one of the eighteen types. Notable Trainers who specialize in Ghost-type Pokémon are Agatha of the Indigo Plateau Elite Four, Morty of Ecruteak City, Phoebe of the Hoenn Elite Four, Fantina of Hearthome City, Shauntal of the Unova Elite Four, and Acerola of the Alola Elite Four. Prior to changes in Generation IV, all damaging Ghost-type moves were physical, but they may now also be special depending on the attack.\n"}, "Dragon": {"description": "The Dragon type (Japanese: ドラゴンタイプ Dragon type) is one of the eighteen types. Notable Trainers who specialize in Dragon-type Pokémon are Lance, the current Champion of the Indigo Plateau, Clair of Blackthorn City, Drake of the Hoenn Elite Four, Drayden of Opelucid City, Iris, the current Champion of the Unova Pokémon League, Drasna of the Kalos Elite Four, Zinnia of the Draconid people, and Ryuki. Prior to changes in Generation IV, all damaging Dragon-type moves were special, but they may now also be physical depending on the attack.\n"}}