{"1": {"dexnum": 1, "name": "Bulbasaur", "alias": "Seed Pokémon", "sprite": "bulbasaur_spr.png", "image": "bulbasaur_img.png", "type": ["Grass", "Poison"], "description": "Bulbasaur is a small, quadruped Pokémon that has blue-green skin with darker green patches. It has red eyes with white pupils and scleras. It also has pointed, ear-like structures on top of its head. Its snout is short and blunt, and it has a wide mouth. A pair of small, pointed teeth are visible in the upper jaw when its mouth is open. Each of its thick legs ends with three sharp claws. On its back is a green plant bulb, which is grown from a seed planted there at birth. The bulb provides it with energy through photosynthesis as well as from the nutrient-rich seeds contained within.", "evolutions": ["Bulbasaur", "Ivysaur", "Venosaur"], "height": 70, "weight": 6.9}, "2": {"dexnum": 2, "name": "Ivysaur", "alias": "Seed Pokémon", "sprite": "ivysaur_spr.png", "image": "ivysaur_img.png", "type": ["Grass", "Poison"], "description": "Ivysaur is a quadruped Pokémon similar to a dinosaur. It has blue-green skin with darker patches. On top of its head are pointed ears with black insides, and it has narrow red eyes. It has a short, rounded snout with a wide mouth. Two pointed teeth protrude from its upper jaw. Each of its feet has three claws on them. The bulb on its back has bloomed into a large pink bud. A short brown trunk surrounded by leafy green fronds supports the bud. The weight of the plant prevents Ivysaur from standing on its hind legs and forces its legs to grow sturdy. When its flower is ready to bloom, it gives off a distinct, strong sweet-smelling aroma and starts swelling. Ivysaur will also start spending more time in sunlight in preparation for its upcoming evolution. Exposure to sunlight adds to the strength of both Ivysaur and its plant. Ivysaur's natural habitat is plains.", "evolutions": ["Bulbasaur", "Ivysaur", "Venosaur"], "height": 100, "weight": 13}, "3": {"dexnum": 3, "name": "Venosaur", "alias": "Seed Pokémon", "sprite": "venosaur_spr.png", "image": "venosaur_img.png", "type": ["Grass", "Poison"], "description": "Venusaur is a squat, quadruped Pokémon with bumpy, blue-green skin. It has small, circular red eyes, a short, blunt snout, and a wide mouth with two pointed teeth in the upper jaw and four in the lower jaw. On top of its head are small, pointed ears with reddish pink insides. It has three clawed toes on each foot. The bud on its back has bloomed in a large pink, white-spotted flower. The flower is supported by a thick, brown trunk surrounded by green fronds. A female Venusaur will have a seed in the center of its flower.", "evolutions": ["Bulbasaur", "Ivysaur", "Venosaur"], "height": 200, "weight": 100}, "4": {"dexnum": 4, "name": "Charmander", "alias": "Lizard Pokémon", "sprite": "charmander_spr.png", "image": "charmander_img.png", "type": ["Fire"], "description": "Charmander is a bipedal, reptilian Pokémon with a primarily orange body. Its underside from the chest down and soles are cream-colored. It has two small fangs visible in its upper jaw and two smaller fangs in its lower jaw. Charmander has blue eyes. Its arms and legs are short with four fingers and three clawed toes. A fire burns at the tip of this Pokémon's slender tail and has blazed there since Charmander's birth. The flame can be used as an indication of Charmander's health and mood, burning brightly when the Pokémon is strong, weakly when it is exhausted, wavering when it is happy, and blazing when it is enraged. It is said that Charmander dies if its flame goes out. However, if the Pokémon is healthy, the flame will continue to burn even if it gets a bit wet and is said to steam in the rain.", "evolutions": ["Charmander", "Charmeleon", "Charizard"], "height": 60, "weight": 8.5}, "5": {"dexnum": 5, "name": "Charmeleon", "alias": "Flame Pokémon", "sprite": "charmeleon_spr.png", "image": "charmeleon_img.png", "type": ["Fire"], "description": "Charmeleon is a bipedal, reptilian creature. It has bright-red scales and a cream underside. There is a horn-like protrusion on the back of its head, and it has narrow blue eyes and a long snout. It has relatively long arms with three sharp claws. Its short legs have feet with three claws and cream-colored soles. The tip of its long, powerful tail has a flame burning on it. The temperature rises to unbearable levels if Charmeleon swings its tail.", "evolutions": ["Charmander", "Charmeleon", "Charizard"], "height": 110, "weight": 19}, "6": {"dexnum": 6, "name": "Charizard", "alias": "Flame Pokémon", "sprite": "charizard_spr.png", "image": "charizard_img.png", "type": ["Fire", "Flying"], "description": "Charizard is a draconic, bipedal Pokémon. It is primarily orange with a cream underside from the chest to the tip of its tail, which burns with a sizable flame. Charizard has a long neck, small blue eyes, raised nostrils, and two horn-like structures protruding from the back of its rectangular head. There are two fangs visible in the upper jaw when its mouth is closed. Two large wings with blue-green undersides sprout from its back, and a horn-like appendage juts out from the third joint of each wing. Charizard's arms are short and skinny compared to its robust belly, and each limb has three white claws. It has stocky legs and cream-colored soles under its feet.", "evolutions": ["Charmander", "Charmeleon", "Charizard"], "height": 170, "weight": 90.5}, "7": {"dexnum": 7, "name": "Squirtle", "alias": "Tiny Turtle", "sprite": "squirtle_spr.png", "image": "squirtle_img.png", "type": ["Water"], "description": "Squirtle is a small Pokémon that resembles a light blue turtle. While it typically walks on its two short legs, it has been shown to run on all fours in Super Smash Bros. Brawl. It has large eyes and a slightly hooked upper lip. Each of its hands and feet has three pointed digits. The end of its long tail curls inward. Its body is encased by a tough shell that forms and hardens after birth. This shell is brown on the top, pale yellow on the bottom, and has a thick white ridge between the two halves. Squirtle's shell is a useful tool. It can withdraw into the shell for protection or for sleeping, and its grooved, rounded shape helps to reduce water resistance when this Pokémon swims. Squirtle can spray foamy water from its mouth with great accuracy. In the past, Skull Bash was its signature move. Squirtle is scarce in the wild, although it can be found around small ponds and lakes.", "evolutions": ["Squirtle", "Wartortle", "Blastoise"], "height": 50, "weight": 9}, "8": {"dexnum": 8, "name": "Wartortle", "alias": "Turtle Pokémon", "sprite": "wartortle_spr.png", "image": "wartortle_img.png", "type": ["Water"], "description": "Wartortle is a bipedal, indigo Pokémon similar to a turtle. It has brown eyes, a dark blue streak on each cheek, and two sharp teeth protruding from its upper jaw. It has three clawed fingers and pointed toes. Pale blue fur covers its long ears and tail. A brown shell with a pale yellow underside encases its body. A thick, white rim separates the upper and lower halves of the shell. As Wartortle grows old, its tail fur will darken, and it may have algae growing on its shell. The shell may also carry scars from past battles. To maintain balance while swimming at high speeds, Wartortle moves its furry ears and tail. It can use the fur to store air for extended underwater diving. Its tail is a popular symbol of longevity, making it popular with the elderly.", "evolutions": ["Squirtle", "Wartortle", "Blastoise"], "height": 100, "weight": 22.5}, "9": {"dexnum": 9, "name": "Blastoise", "alias": "Shellfish Pokémon", "sprite": "blastoise_spr.png", "image": "blastoise_img.png", "type": ["Water"], "description": "Blastoise is a large, bipedal turtle-like Pokémon. Its body is blue and is mostly hidden by its tough, brown shell. This shell has a pale yellow underside and a white ridge encircling its arms and separating the upper and lower halves. Two powerful water cannons reside in the top sides of its shell. These cannons can be extended or withdrawn and can be used to assist in high-speed charges. Blastoise's head has triangular ears that are black on the inside, small brown eyes, and a cream-colored lower jaw. Its arms are thick and striated with three claws on each hand. Its feet have three claws on the front and one on the back. It has a stubby tail. The powerful cannons on this Pokémon's back are capable of producing water blasts that can pierce steel and concrete. Blastoise deliberately makes itself heavy to withstand these powerful blasts, and it will crush its opponents with its bulk. It has two former signature moves, Skull Bash and Hydro Cannon.", "evolutions": ["Squirtle", "Wartortle", "Blastoise"], "height": 160, "weight": 85.5}}